podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/AIPS0_MK28F15.svd.xml
<!--
Devices using this peripheral: 
      MK28F15
-->
      <peripheral>
         <?sourceFile "AIPS0_MK28F15" ?>
         <name>AIPS0</name>
         <description>AIPS-Lite Bridge</description>
         <groupName>AIPS</groupName>
         <headerStructName>AIPS0</headerStructName>
         <baseAddress>0x40000000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x20</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x40</offset>
            <size>0x30</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>MPRA</name>
               <description>Master Privilege Register A</description>
               <addressOffset>0x0</addressOffset>
               <resetValue>0x77700000</resetValue>
               <fields>
                  <field>
                     <name>MPL4</name>
                     <description>Master 4 Privilege Level</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from this master are forced to user-mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from this master are not forced to user-mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MTW4</name>
                     <description>Master 4 Trusted For Writes</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This master is not trusted for write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This master is trusted for write accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MTR4</name>
                     <description>Master 4 Trusted For Read</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This master is not trusted for read accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This master is trusted for read accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="MPL4" > <name>MPL3</name> <description>Master 3 Privilege Level</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="MTW4" > <name>MTW3</name> <description>Master 3 Trusted For Writes</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="MTR4" > <name>MTR3</name> <description>Master 3 Trusted For Read</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="MPL4" > <name>MPL2</name> <description>Master 2 Privilege Level</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="MTW4" > <name>MTW2</name> <description>Master 2 Trusted For Writes</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="MTR4" > <name>MTR2</name> <description>Master 2 Trusted For Read</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="MPL4" > <name>MPL1</name> <description>Master 1 Privilege Level</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="MTW4" > <name>MTW1</name> <description>Master 1 Trusted for Writes</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="MTR4" > <name>MTR1</name> <description>Master 1 Trusted for Read</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="MPL4" > <name>MPL0</name> <description>Master 0 Privilege Level</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="MTW4" > <name>MTW0</name> <description>Master 0 Trusted For Writes</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="MTR4" > <name>MTR0</name> <description>Master 0 Trusted For Read</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRA</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x20</addressOffset>
               <resetValue>0x40004000</resetValue>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRB</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x24</addressOffset>
               <resetValue>0x44004404</resetValue>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PACRC</name>
               <description>Peripheral Access Control Register</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>TP7</name>
                     <description>Trusted Protect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Accesses from an untrusted master are allowed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Accesses from an untrusted master are not allowed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WP7</name>
                     <description>Write Protect</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral allows write accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral is write protected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SP7</name>
                     <description>Supervisor Protect</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>This peripheral does not require supervisor privilege level for accesses</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>This peripheral requires supervisor privilege level for accesses</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TP7" > <name>TP6</name> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP6</name> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP6</name> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP5</name> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP5</name> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP5</name> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP4</name> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP4</name> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP4</name> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP3</name> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP3</name> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP3</name> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP2</name> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP2</name> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP2</name> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP1</name> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP1</name> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP1</name> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="TP7" > <name>TP0</name> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="WP7" > <name>WP0</name> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="SP7" > <name>SP0</name> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
